app/views/articles/index.html.erb

          <td align="left">
            <%= article.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]