app/views/articles/index.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 12]]
---
              %td{:align => "left"}
                = article.comments.count